$(document).ready(function () {
    $('#con').mouseenter(function () {
        document.getElementById('dd').innerHTML = 'Психология — гуманитарная научная дисциплина, изучающая закономерности возникновения, развития и функционирования психики<br> и психической деятельности человека и групп людей. Тем не менее психология объединяет в себе гуманитарный и естественно-научный подходы.';
    });
     
    $('#sss').mouseenter(function () {
        document.getElementById('sss').innerHTML = '<div class="icon-holder">' +
            '<span aria-hidden="true" class="icon icon_lifesaver"></span>' +
            '</div><h3 class="title">Психология</h3>Психология — гуманитарная научная дисциплина, изучающая закономерности возникновения, развития и функционирования психики<br> и психической деятельности человека и групп людей. Тем не менее психология объединяет в себе гуманитарный и естественно-научный подходы.';
    });
     
    $('#sss').mouseleave(function () {
        document.getElementById('sss').innerHTML = '<div class="icon-holder">' +
            '<span aria-hidden="true" class="icon icon_lifesaver"></span>' +
            '</div><h3 class="title">Психология</h3>Психология — гуманитарная научная дисциплина, изучающая закономерности возникновения, развития и функционирования психики<br> и психической деятельности человека и групп людей. ....';
    });
   
    $('#sss1').mouseenter(function () {
        document.getElementById('sss1').innerHTML = `<div class="icon-holder">
        <span aria-hidden="true" class="icon icon_datareport_alt"></span>
    </div><!--//icon-holder-->
    <h3 class="title">Возрастная психология</h3>`+ 'Психология развития — отрасль психологии, которая включает в себя целый ряд областей, таких как педагогическая психология, детская психопатология, судебная психология, психология развития ребёнка, когнитивная психология, экологическая психология и культурная психология.';
    });
    $('#sss1').mouseleave(function () {
        document.getElementById('sss1').innerHTML = `<div class="icon-holder">
        <span aria-hidden="true" class="icon icon_datareport_alt"></span>
    </div><!--//icon-holder-->
    <h3 class="title">Возрастная психология</h3>`+ 'Психология развития — отрасль психологии, которая включает в себя целый ряд областей, таких как педагогическая психология, детская психопатология, судебная психология, ....';
    });
     
     
    /*   $('#asd').mouseenter(function(){
          document.getElementById('asd').innerHTML = 'Психология развития — отрасль психологии, которая включает в себя целый ряд областей, таких как педагогическая психология, детская психопатология, судебная психология, психология развития ребёнка, когнитивная психология, экологическая психология и культурная психология.';
      });
      $('#asd').mouseleave(function(){
          document.getElementById('asd').innerHTML = 'fdfgdfgdfg';
      }); */
});


/* 
Семейная психология; психология семьи — раздел психологии, изучающий эволюцию и сущность брачно-семейных отношений, особенности их возникновения, становления, стабилизации и распада, описывающий характеристики семьи и брака в историческом, социально-психологическом, и индивидуально-психологическом контекстах, рассматривающий эмоциональную и функциональную специфику отношений членов семьи друг с другом. */