             /******************обработка синонимов*****************/
			 //-------------------------------------------
             function verifyIts_searchall(field)  
             {                   
                  var aSynonyms = {
							  'gtml':  'html',
							  'htnl':  'html',
							  'gt,l':  'html',
							  'thml':  'html',
							  'gyml':  'html',
							  'gymk':  'html',
							  'gym;':  'html',
							  'kbytqysq uhflbtyn':'Линейный градиент',
							  'линейній градиент':'Линейный градиент',
							  'линейный градент':'Линейный градиент',
							  'rkbtyn-cthdthyst ghbkj;tybz':'клиент-серверная архитектура',
							  'архитектура мобильтного приложения':'архитектура мобильного приложения',
							  'rkbtyn':'клиент',
							  'коиент':'клиент',
							  'клиаент':'клиент',
							  'улент':'клиент',
							  'клиегт':'клиент',
							  'клиени':'клиент',
							  'клинт':'клиент',
							  'клиень':'клиент',
							  'клиени-серверная архитектура':'клиент-серверная архитектура',
							  'jujym':'огонь',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
							  '':'',
                                  };



                  var string = field.value; 

                  string = string.trim();


                            for (var j in aSynonyms)              
                            {
                                 if (string == j)
                                 {
                            
                                     field.value = aSynonyms[j];
                                     return true; 
                                 }
                            }

                   return true;
            }